ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/GPIOB_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="GPIOB" HW_revision="1.0">
    <register id="GPIOB_FSUB_0" width="32" offset="0x400" description="Subsciber Port 0">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <register id="GPIOB_FSUB_1" width="32" offset="0x404" description="Subscriber Port 1">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <register id="GPIOB_FPUB_0" width="32" offset="0x444" description="Publisher Port 0">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <register id="GPIOB_FPUB_1" width="32" offset="0x448" description="Publisher Port 1">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <group id="GPIOB_GPRCM" name="GPIOB_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="GPIOB_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="GPIOB_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="GPIOB_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
        </group>
    <register id="GPIOB_CLKOVR" width="32" offset="0x1010" description="Clock Override">
        <bitfield id="OVERRIDE" description="Unlocks the functionality of [RUN_STOP] to override the automatic peripheral clock request" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLED" value="0x0" description="Override disabled"/>
            <bitenum id="ENABLED" value="0x1" description="Override enabled"/>
        </bitfield>
        <bitfield id="RUN_STOP" description="If [OVERRIDE] is enabled, this register is used to manually control the peripheral's clock request to the system" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="RUN" value="0x0" description="Run/ungate functional clock"/>
            <bitenum id="STOP" value="0x1" description="Stop/gate functional clock"/>
        </bitfield>
    </register>
    <register id="GPIOB_PDBGCTL" width="32" offset="0x1018" description="Peripheral Debug Control">
        <bitfield id="FREE" description="Free run control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted."/>
            <bitenum id="RUN" value="0x1" description="The peripheral ignores the state of the Core Halted input"/>
        </bitfield>
    </register>
